<?php
return [

    // name
    'name.required' => 'الاسم مطلوب.',
    'name.string'   => 'الاسم يجب أن يكون نصًا.',
    'name.max'      => 'الاسم لا يجب أن يزيد عن 255 حرف.',

    // email
    'email.required' => 'البريد الإلكتروني مطلوب.',
    'email.string'   => 'البريد الإلكتروني يجب أن يكون نصًا.',
    'email.email'    => 'صيغة البريد الإلكتروني غير صحيحة.',
    'email.max'      => 'البريد الإلكتروني لا يجب أن يزيد عن 255 حرف.',
    'email.unique'   => 'البريد الإلكتروني مستخدم بالفعل.',
    'email.used_in'  => 'البريد الالكتروني مستخدم في حساب اخر',
    // phone
    'phone.required'        => 'رقم الهاتف مطلوب.',
    'phone.string'          => 'رقم الهاتف يجب أن يكون نصًا.',
    'phone.digits_between'  => 'رقم الهاتف يجب أن يكون بين 10 و 15 رقم.',
    'phone.unique'          => 'رقم الهاتف مستخدم بالفعل.',
    'phone.used_in'         => 'رقم الهاتف مستخدم في حساب اخر',

    // password
    'password.required'   => 'كلمة المرور مطلوبة.',
    'password.string'     => 'كلمة المرور يجب أن تكون نصًا.',
    'password.min'        => 'كلمة المرور يجب ألا تقل عن 6 أحرف.',
    'password.confirmed'  => 'تأكيد كلمة المرور غير متطابق.',
    "Media_reporter" => "مراسل وسائل الإعلام",
    "visitor" => "زائر",
    "signup"  => "انشاء حساب",
];
