<?php
return [
    'name.string' => 'الاسم يجب أن يكون نصًا صحيحًا.',
    'name.min'    => 'الاسم يجب ألا يقل عن 3 أحرف.',
    'name.max'    => 'الاسم يجب ألا يزيد عن 255 حرفًا.',

    'email.email' => 'من فضلك أدخل بريدًا إلكترونيًا صحيحًا.',

    'phone.digits' => 'رقم الهاتف يجب أن يكون بين 10 و 15 رقمًا.',

    'experience.string' => 'الخبرة يجب أن تكون نصًا صحيحًا.',
    'experience.min'    => 'الخبرة يجب ألا تقل عن 3 أحرف.',
    'experience.max'    => 'الخبرة يجب ألا تزيد عن 255 حرفًا.',

    'job_title.string' => 'المسمى الوظيفي يجب أن يكون نصًا صحيحًا.',
    'job_title.min'    => 'المسمى الوظيفي يجب ألا يقل عن 3 أحرف.',
    'job_title.max'    => 'المسمى الوظيفي يجب ألا يزيد عن 255 حرفًا.',

    'name_governorate.string' => 'اسم المحافظة يجب أن يكون نصًا صحيحًا.',
    'name_governorate.min'    => 'اسم المحافظة يجب ألا يقل عن 3 أحرف.',
    'name_governorate.max'    => 'اسم المحافظة يجب ألا يزيد عن 255 حرفًا.',

    'name_city.string' => 'اسم المدينة يجب أن يكون نصًا صحيحًا.',
    'name_city.min'    => 'اسم المدينة يجب ألا يقل عن 3 أحرف.',
    'name_city.max'    => 'اسم المدينة يجب ألا يزيد عن 255 حرفًا.',

    'update_successfully' => "تم تحديث بيانت الحساب الخاص بك بنجاح",
    'image.image' => 'الملف المرفوع يجب أن يكون صورة.',
    'image.mimes' => 'الصورة يجب أن تكون بصيغة jpg أو jpeg أو png أو webp.',
    'image.max'   => 'حجم الصورة يجب ألا يزيد عن 2 ميجابايت.',
];
