<?php
return [
    "otp.required" => "يجب ادخال رمز التحقق الذي تم ارسالة لك لتتمكن من تغير كلمة السر الخاصة بك",
    "otp.digits" => "يجب ان يتكون رمز التحقق من 6 ارقام فقط لا غير",
    "failed_otp" => "رمز التحقق الذي ادخلتة غير صحيح يرجي المحاولة مره اخري",
    "expired" => "انتهت صلاحية رمز التحقق يرجي طلب رمز جديد",
    "used" => "تم استخدام رمز التحقق هذا من قبل",
    "login.required" => "يمكنك ادخال البريد الالكتروني او رقم الهاتف ليصلك من خلالها رمز التحقق لتغير كلمة المرور",
    "password.required" => "يجب ادخال كلمة المرور",
    "password.min" => "يجب أن تكون كلمة المرور على الأقل 8 أحرف",
    "password.string" => "يجب الا تحتوي كلمة المرور علي حروف خاصة",
    "failed" => "بيانات الدخول غير صحيحة",
    // name
    'name.required' => 'الاسم مطلوب.',
    'name.string'   => 'الاسم يجب أن يكون نصًا.',
    'name.max'      => 'الاسم لا يجب أن يزيد عن 255 حرف.',

    // email
    'email.required' => 'البريد الإلكتروني مطلوب.',
    'email.string'   => 'البريد الإلكتروني يجب أن يكون نصًا.',
    'email.email'    => 'صيغة البريد الإلكتروني غير صحيحة.',
    'email.max'      => 'البريد الإلكتروني لا يجب أن يزيد عن 255 حرف.',
    'email.unique'   => 'البريد الإلكتروني مستخدم بالفعل.',
    'email.used_in'  => 'البريد الالكتروني مستخدم في حساب اخر',
    // phone
    'phone.required'        => 'رقم الهاتف مطلوب.',
    'phone.string'          => 'رقم الهاتف يجب أن يكون نصًا.',
    'phone.digits_between'  => 'رقم الهاتف يجب أن يكون بين 10 و 15 رقم.',
    'phone.unique'          => 'رقم الهاتف مستخدم بالفعل.',
    'phone.used_in'         => 'رقم الهاتف مستخدم في حساب اخر',

    // password
    'password.confirmed'  => 'تأكيد كلمة المرور غير متطابق.',
    "Media_reporter" => "مراسل وسائل الإعلام",
    "visitor" => "زائر",
    "signup"  => "انشاء حساب",
    "password.reset" => "password has been reset successfully",
    "logout" => "تم تسجيل الخروج بنجاح",
    'name.min'    => 'الاسم يجب ألا يقل عن 3 أحرف.',


    'phone.digits' => 'رقم الهاتف يجب أن يكون بين 10 و 15 رقمًا.',

    'experience.string' => 'الخبرة يجب أن تكون نصًا صحيحًا.',
    'experience.min'    => 'الخبرة يجب ألا تقل عن 3 أحرف.',
    'experience.max'    => 'الخبرة يجب ألا تزيد عن 255 حرفًا.',

    'job_title.string' => 'المسمى الوظيفي يجب أن يكون نصًا صحيحًا.',
    'job_title.min'    => 'المسمى الوظيفي يجب ألا يقل عن 3 أحرف.',
    'job_title.max'    => 'المسمى الوظيفي يجب ألا يزيد عن 255 حرفًا.',

    'name_governorate.string' => 'اسم المحافظة يجب أن يكون نصًا صحيحًا.',
    'name_governorate.min'    => 'اسم المحافظة يجب ألا يقل عن 3 أحرف.',
    'name_governorate.max'    => 'اسم المحافظة يجب ألا يزيد عن 255 حرفًا.',

    'name_city.string' => 'اسم المدينة يجب أن يكون نصًا صحيحًا.',
    'name_city.min'    => 'اسم المدينة يجب ألا يقل عن 3 أحرف.',
    'name_city.max'    => 'اسم المدينة يجب ألا يزيد عن 255 حرفًا.',

    'update_successfully' => "تم تحديث بيانت الحساب الخاص بك بنجاح",
    'image.image' => 'الملف المرفوع يجب أن يكون صورة.',
    'image.mimes' => 'الصورة يجب أن تكون بصيغة jpg أو jpeg أو png أو webp.',
    'image.max'   => 'حجم الصورة يجب ألا يزيد عن 2 ميجابايت.',

    'title.string' => 'يجب ان يكون العناون عبارة عن نص',
    'body.string'  => 'وصف البوست يجب ان يكون نص',
    'post.create' => 'تم انشاء البوست الخاص بك بنجاح',
    'post.favorite' => 'تم اضافة البوست بنجاح',
    'postFavorite.exist' => 'هذا البوست مضاف الي المفضلة مسبقا',
    'search.userNotFound' => 'لا يوجد مستخدم بهذا الاسم',

];
